{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Вам нужно помочь секретарю автоматизировать работу. Для этого нужно написать программу, которая будет на основе хранимых данных исполнять пользовательские команды.\n",
    "Исхоlные данные имеют следующую структуру:\n",
    "1. перечень всех документов\n",
    "documents = [\n",
    "{‘type’: ‘passport’, ‘number’: ‘2207 876234’, ‘name’: ‘Василий Гупкин’},\n",
    "{‘type’: ‘invoice’, ‘number’: ‘11-2’, ‘name’: ‘Геннадий Покемонов’},\n",
    "{‘type’: ‘insurance’, ‘number’: ‘10006’, ‘name’: ‘Аристарх Павлов’}\n",
    "]\n",
    "2.перечень полок, на которых хранятся документы (если документ есть в documents, то он обязательно должен быть и в directories)\n",
    "directories = {\n",
    "‘1’: [‘2207 876234’, ‘11-2’],\n",
    "‘2’: [‘10006’],\n",
    "‘3’: []\n",
    "}\n",
    "Общие требования к программе:\n",
    "код должен быть грамотно декомпозирован (каждая функция отвечает за свою конкретную задачу, дублирующийся функционал переиспользуется, а его код не повторяется);\n",
    "в коде отсутствуют глобальные переменные (за исключением documents и directories);\n",
    "пользовательский ввод обрабатывается в цикле while до тех пор, пока пользователь явно не завершит программу (вводом команды “q”).\n",
    "Пункт 1. Пользователь по команде “p” может узнать владельца документа по его номеру\n",
    "Пункт 2. Пользователь по команде “s” может по номеру документа узнать на какой полке он хранится\n",
    "Пункт 3. Пользователь по команде “l” может увидеть полную информацию по всем документам\n",
    "Пункт 5. Пользователь по команде “ds” может удалить существующую полку из данных (только если она пустая)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "documents = [ {'type': 'passport', 'number': '2207 876234', 'name': 'Василий Гупкин'}, \n",
    "             {'type': 'invoice', 'number': '11-2', 'name': 'Геннадий Покемонов'}, \n",
    "             {'type': 'insurance', 'number': '10006', 'name': 'Аристарх Павлов'} ] \n",
    "directories = { '1': ['2207 876234', '11-2'], \n",
    "               '2': ['10006'], \n",
    "               '3': [] }"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите команду - s\n",
      "Введите номер документа - 10006\n",
      "Документ находится на полке номер 2\n",
      "Введите команду - q\n"
     ]
    }
   ],
   "source": [
    "def check_document_existance(user_doc_number):\n",
    "    doc_founded = False\n",
    "    for current_document in documents:\n",
    "        doc_number = current_document['number']\n",
    "        if doc_number == user_doc_number:\n",
    "            doc_founded = True\n",
    "            break\n",
    "    return doc_founded\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "def get_doc_owner_name():\n",
    "    user_doc_number = input('Введите номер документа - ')\n",
    "    print()\n",
    "    doc_exist = check_document_existance(user_doc_number)\n",
    "    if doc_exist:\n",
    "        for current_document in documents:\n",
    "            doc_number = current_document['number']\n",
    "            if doc_number == user_doc_number:\n",
    "                return current_document['name']\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "def del_shelf(shelf_number=''):\n",
    "    if not shelf_number:\n",
    "        shelf_number = input('Введите номер полки - ')\n",
    "    if shelf_number in directories.keys():\n",
    "        if directories[shelf_number] == []:\n",
    "            del directories[shelf_number]\n",
    "            print ('Полка удалена')\n",
    "        else:\n",
    "            print('Полка не удалена')\n",
    "        \n",
    "\n",
    "\n",
    "\n",
    "\n",
    "def get_doc_shelf():\n",
    "    user_doc_number = input('Введите номер документа - ')\n",
    "    doc_exist = check_document_existance(user_doc_number)\n",
    "    if doc_exist:\n",
    "        for directory_number, directory_docs_list in directories.items():\n",
    "            if user_doc_number in directory_docs_list:\n",
    "                return directory_number\n",
    "\n",
    "            \n",
    "            \n",
    "            \n",
    "def show_document_info(document):\n",
    "    doc_type = document['type']\n",
    "    doc_number = document['number']\n",
    "    doc_owner_name = document['name']\n",
    "    print('{} \"{}\" \"{}\"'.format(doc_type, doc_number, doc_owner_name))\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "def show_all_docs_info():\n",
    "    print('Список всех документов:\\n')\n",
    "    for current_document in documents:\n",
    "        show_document_info(current_document)\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "def main_program():\n",
    "    while True:\n",
    "        user_command = input('Введите команду - ')\n",
    "        if user_command == 'p':\n",
    "            owner_name = get_doc_owner_name()\n",
    "            print('Владелец документа - {}'.format(owner_name))\n",
    "        elif user_command == 'l':\n",
    "            show_all_docs_info()\n",
    "        elif user_command == 's':\n",
    "            directory_number = get_doc_shelf()\n",
    "            print('Документ находится на полке номер {}'.format(directory_number))\n",
    "        elif user_command == 'ds':\n",
    "            del_shelf()\n",
    "        elif user_command == 'q':\n",
    "            break\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "if __name__ == '__main__':\n",
    "    main_program()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
